; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v1 - type_2 ?v7 - type_1)
 	      (pred_2 ?v4 - object ?v7 - type_1)
	      (pred_3 ?v1 - type_2 ?v6 - type_3)
	      (pred_1 ?v1 - type_2 ?v4 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v1 - type_2 ?v3 ?v5 - type_1)
       :precondition (and  (pred_4 ?v1 ?v3))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_2 ?v2 - object ?v8 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v8) (pred_4 ?v1 ?v8) (pred_3 ?v1 ?v6))
       :effect (and (pred_1 ?v1 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v8)) 
		    (not (pred_3 ?v1 ?v6))))

   (:action op_3
       :parameters (?v1 - type_2 ?v2 - object ?v8 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v2 ?v6) (pred_4 ?v1 ?v8))
       :effect (and (pred_2 ?v2 ?v8)
		    (pred_3 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v2 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_05 - type_2
obj_02 obj_07 obj_11 obj_04 - type_3
obj_13 obj_03 obj_10 obj_06 - type_1
obj_09 obj_08 obj_01 - object)
(:init
(pred_4 obj_12 obj_13)
(pred_3 obj_12 obj_02)
(pred_3 obj_12 obj_07)
(pred_4 obj_05 obj_13)
(pred_3 obj_05 obj_11)
(pred_3 obj_05 obj_04)
(pred_2 obj_09 obj_13)
(pred_2 obj_08 obj_10)
(pred_2 obj_01 obj_10)
)
(:goal
(and
(pred_2 obj_09 obj_13)
(pred_2 obj_08 obj_10)
(pred_2 obj_01 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_12 obj_10)))
)
)

; plan
1. (op_1 obj_05 obj_13 obj_10)
   deleted: (pred_4 obj_05 obj_13)
   added: (pred_4 obj_05 obj_10)
   goals met: 2 of 3
2. (op_2 obj_05 obj_01 obj_10 obj_04)
   deleted: (pred_2 obj_01 obj_10) (pred_3 obj_05 obj_04)
   added: (pred_1 obj_05 obj_01 obj_04)
   goals met: 2 of 3
3. (op_1 obj_05 obj_10 obj_13)
   deleted: (pred_4 obj_05 obj_10)
   added: (pred_4 obj_05 obj_13)
   goals met: 2 of 3
4. (op_3 obj_05 obj_01 obj_13 obj_04)
   deleted: (pred_1 obj_05 obj_01 obj_04)
   added: (pred_2 obj_01 obj_13) (pred_3 obj_05 obj_04)
   goals met: 3 of 3
